In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.1-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.1-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   -- ------------------------------------- 0.8/11.0 MB 5.4 MB/s eta 0:00:02
   ------ --------------------------------- 1.8/11.0 MB 4.7 MB/s eta 0:00:02
   ---------- ----------------------------- 2.9/11.0 MB 4.5 MB/s eta 0:00:02
   ------------- -------------------------- 3.7/11.0 MB 4.5 MB/s eta 0:00:02
   ---------------- ----------------------- 4.5/11.0 MB 4.2 MB/s eta 0:00:02
   -------------------- ------------------- 5.5/11.0 MB 4.3 MB/s eta 0:00:02
   ----------------------- ---------------- 6.6/11.0 MB 4.4 MB/s eta 0:00:02
   -------------------------- ------------- 7.3/11.0 MB 4.4 MB/s eta 0:00:01
   ------------------------------ --------- 8.4/11.0 MB 4.3 MB/s eta 0:00:01
   --------------------------------- ------ 9.2/11.0 MB 4.3 MB/s eta 0:00:01
   ------------------------------------ --- 10.0/11.0 MB 4.3 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 4.3 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 4.2 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.1 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
import pandas as pd
import numpy as np
seri = pd.Series([1,2,3,4,5,6,7,8,9])
print(seri)
type(seri)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

pandas.core.series.Series

In [3]:
print(seri.axes)

[RangeIndex(start=0, stop=9, step=1)]

In [7]:
print(seri.size)
print(seri.ndim)

9
1

In [8]:
print(seri.values)

[1 2 3 4 5 6 7 8 9]

In [11]:
seri.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
print(seri.head(3))
# eğer head içine değer yazarsak o kadar değeri döndürür

0    1
1    2
2    3
dtype: int64

In [13]:
seri.tail()

4    5
5    6
6    7
7    8
8    9
dtype: int64

In [14]:
print(seri.tail(3))

6    7
7    8
8    9
dtype: int64

In [8]:
import pandas as pd
seri1 = pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])
print(seri1)

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [9]:
print(seri1["a"]) # bu işlem a değerini döndürür

99

In [10]:
print(seri1["a" : "c"]) # bu işlem a'dan c'ye kadar olan değerleri döndürür

a     99
b     22
c    332
dtype: int64

In [ ]:
sozluk = {"reg": 10, "log": 11, "card": 12} # sözlük oluşturma
seri2 = pd.Series(sozluk) # sözlükten seri oluşturma
print(seri2)

reg     10
log     11
card    12
dtype: int64

In [ ]:
import numpy as np
import pandas as pd
randomNumbers = np.random.randint(10,100,5) # 10 ile 100 arasında 5 adet rastgele sayı üretir
pandas = pd.Series(randomNumbers) # pandas serisi oluşturur
print(pandas) 
print(pandas[0])

0    32
1    32
2    78
3    45
4    16
dtype: int32
32

In [16]:
seri3 = pd.Series([200,121,150,99], index = ["a","b","c","d"])
print(seri3)

a    200
b    121
c    150
d     99
dtype: int64

In [ ]:
seri3.index #serinin index değerlerini döndürür

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
seri3.keys() #index ile aynı işlemi yapar

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
print(list(seri3.items())) #serinin index ve değerlerini döndürür

[('a', 200), ('b', 121), ('c', 150), ('d', 99)]

In [24]:
"a" in seri3 # a değeri serinin içinde mi?

True

In [27]:
seri3[["a","b"]] #a ve b değerlerini döndürür

a    200
b    121
dtype: int64

In [28]:
seri3["a"] = 250 # a değerini 250 olarak günceller
print(seri3)

a    250
b    121
c    150
d     99
dtype: int64

In [29]:
l = [1,2,3,4,5]
pd.DataFrame(l, columns=["degisken_ismi"]) # DataFrame oluşturma

   degisken_ismi
0              1
1              2
2              3
3              4
4              5

In [ ]:
n = np.arange(1,10).reshape((3,3)) # 1'den 10'a kadar olan sayıları 3x3'lük bir matris olarak oluşturur
pd.DataFrame(n, columns=["1","2","3"])

   1  2  3
0  1  2  3
1  4  5  6
2  7  8  9

In [32]:
df = pd.DataFrame(n, columns=["var1","var2","var3"])
df.head(2) # DataFrame'in ilk 2 satırını döndürür

   var1  var2  var3
0     1     2     3
1     4     5     6

In [33]:
df.columns= {"degisken1","degisken2","degisken3"} # DataFrame'in kolon isimlerini değiştirir
df

   degisken2  degisken1  degisken3
0          1          2          3
1          4          5          6
2          7          8          9

In [34]:
df.axes # DataFrame'in eksenlerini döndürür

[RangeIndex(start=0, stop=3, step=1),
 Index(['degisken2', 'degisken1', 'degisken3'], dtype='object')]

In [35]:
df.shape # DataFrame'in boyutlarını döndürür

(3, 3)

In [36]:
df.ndim # DataFrame'in boyut sayısını döndürür

2

In [37]:
df.size # DataFrame'in eleman sayısını döndürür

9

In [38]:
df.values # DataFrame'in değerlerini döndürür

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [39]:
df.tail(1) # DataFrame'in son bir satırını döndürür

   degisken2  degisken1  degisken3
2          7          8          9

In [40]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [46]:
sozluk = {"degisken1": s1, "degisken2": s2, "degisken3": s3}
df = pd.DataFrame(sozluk)
df

   degisken1  degisken2  degisken3
0          5          8          8
1          4          6          6
2          2          5          3
3          2          2          0
4          1          6          0

In [47]:
df[0:1] # DataFrame'in ilk satırını döndürür

   degisken1  degisken2  degisken3
0          5          8          8

In [70]:
df.index = ["c","d","e"] # DataFrame'in index değerlerini değiştirir
df

   degisken1  degisken2  degisken3
c          2          5          3
d          2          2          0
e          1          6          0

In [72]:
df["d" : "e"] # DataFrame'in c'den e'ye kadar olan satırlarını döndürür

   degisken1  degisken2  degisken3
d          2          2          0
e          1          6          0

In [73]:
df.drop("c", axis=0) # DataFrame'den b satırını siler
# geçici olarak siler, kalıcı olarak silmek için inplace=True parametresini kullanabilirsiniz

   degisken1  degisken2  degisken3
d          2          2          0
e          1          6          0

In [74]:
df

   degisken1  degisken2  degisken3
c          2          5          3
d          2          2          0
e          1          6          0

In [75]:
df.drop("c", axis=0, inplace=True) # DataFrame'den c satırını kalıcı olarak siler

In [76]:
df

   degisken1  degisken2  degisken3
d          2          2          0
e          1          6          0

In [81]:
l = ["degisken1", "degisken2", "degisken3"] 
for i in l: # döngü ile liste elemanlarını kontrol eder
    print(i in l)

True
True
True

In [ ]:
df["degisken4"] = df["degisken1"] / df["degisken2"] # yeni bir sütun ekler ve var1'in var2'ye bölümü ile doldurur
df

   degisken1  degisken2  degisken3  degisken4
d          2          2          0   1.000000
e          1          6          0   0.166667

In [84]:
df.drop("degisken4", axis=1, inplace=True) # degisken4 sütununu DataFrame'den kalıcı olarak siler
df

   degisken1  degisken2  degisken3
d          2          2          0
e          1          6          0

In [85]:
l = ["degisken1", "degisken2"]
df.drop(l,axis=1) # degisken1 ve degisken2 sütunlarını DataFrame'den siler

   degisken3
d          0
e          0

In [ ]:
m = np.random.randint(1,30, size = (10,3)) # rastgele 10 satır ve 3 sütunlu bir matris oluşturur
df = pd.DataFrame(m, columns=["var1", "var2", "var3"]) # DataFrame oluşturur
df

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3
3    28     2    27
4    21    19     2
5     4    24    26
6    12    29    18
7    23    26    17
8     7     8     8
9    23    18    17

In [90]:
df.loc[0:3] # DataFrame'in 0'dan 3'e kadar olan satırlarını döndürür

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3
3    28     2    27

In [91]:
df.iloc[0:3] # DataFrame'in 0'dan 3'e kadar olan satırlarını döndürür, iloc sayısal indeksleme yapar

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3

In [ ]:
df.iloc[0:0] # DataFrame'in 0'dan 0'a kadar olan satırlarını döndürür, yani boş bir DataFrame döndürür

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [93]:
df.iloc[:3 , :3] # DataFrame'in ilk 3 satırını ve ilk 3 sütununu döndürür

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3

In [96]:
df.loc[0:3,"var3"] # DataFrame'in 0'dan 3'e kadar olan satırlarının var3 sütununu döndürür

0    17
1    19
2     3
3    27
Name: var3, dtype: int32

In [ ]:
df.iloc[0:3, 0:2] 
#DataFrame'in 0'dan 3'e kadar olan satırlarının ilk 2 sütununu döndürür

   var1  var2
0    29    14
1     3    28
2    22    16

In [ ]:
df[df.var1 >15] 
#var1 sütunundaki değerleri 15'ten büyük olan satırları döndürür

   var1  var2  var3
0    29    14    17
2    22    16     3
3    28     2    27
4    21    19     2
7    23    26    17
9    23    18    17

In [ ]:
df[df.var1 % 2 == 0] 
#var1 sütunundaki değerleri 2'ye tam bölünebilen satırları döndürür

   var1  var2  var3
2    22    16     3
3    28     2    27
5     4    24    26
6    12    29    18

In [106]:
df.loc[(df.var1 > 15) & (df.var2 < 15), "var2"] 
#var1 sütunundaki değerleri 15'ten büyük ve var2 sütunundaki değerleri 20'den küçük olan satırları döndürür

0    14
3     2
Name: var2, dtype: int32

In [109]:
df.query("var1 > 15 & var3 < 15")
# DataFrame'de var1 sütunundaki değerleri 15'ten büyük ve var3 sütunundaki değerleri 20'den küçük olan satırları döndürür

   var1  var2  var3
2    22    16     3
4    21    19     2

In [111]:
df2 = df + 99
df2

   var1  var2  var3
0   128   113   116
1   102   127   118
2   121   115   102
3   127   101   126
4   120   118   101
5   103   123   125
6   111   128   117
7   122   125   116
8   106   107   107
9   122   117   116

In [ ]:
pd.concat([df, df2])
# DataFrame'leri birleştirir, df ve df2'yi yan yana ekler

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3
3    28     2    27
4    21    19     2
5     4    24    26
6    12    29    18
7    23    26    17
8     7     8     8
9    23    18    17
0   128   113   116
1   102   127   118
2   121   115   102
3   127   101   126
4   120   118   101
5   103   123   125
6   111   128   117
7   122   125   116
8   106   107   107
9   122   117   116

In [113]:
pd.concat([df, df2], ignore_index=True)
# DataFrame'leri birleştirir ve index değerlerini sıfırlar

    var1  var2  var3
0     29    14    17
1      3    28    19
2     22    16     3
3     28     2    27
4     21    19     2
5      4    24    26
6     12    29    18
7     23    26    17
8      7     8     8
9     23    18    17
10   128   113   116
11   102   127   118
12   121   115   102
13   127   101   126
14   120   118   101
15   103   123   125
16   111   128   117
17   122   125   116
18   106   107   107
19   122   117   116

In [116]:
df2.columns = ["var1", "var2", "var3"] 
pd.concat([df,df2], join="inner")
# DataFrame'leri birleştirir ve ortak sütunları alır

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3
3    28     2    27
4    21    19     2
5     4    24    26
6    12    29    18
7    23    26    17
8     7     8     8
9    23    18    17
0   128   113   116
1   102   127   118
2   121   115   102
3   127   101   126
4   120   118   101
5   103   123   125
6   111   128   117
7   122   125   116
8   106   107   107
9   122   117   116

In [117]:
df1 = pd.DataFrame({"Çalışanlar": ["Ali", "Ayşe", "Mehmet", "Fatma"],
                   "Grup": ["Koordinatör","Full Time Çalışan","Eğitim Koordinatörü","İş Geliştirme"]})
df1

  Çalışanlar                 Grup
0        Ali          Koordinatör
1       Ayşe    Full Time Çalışan
2     Mehmet  Eğitim Koordinatörü
3      Fatma        İş Geliştirme

In [118]:
df2 = pd.DataFrame({"Çalışanlar": ["Ali", "Ayşe", "Mehmet", "Fatma"],
                    "İlk Giriş Yılları": [2021, 2019, 2022, 2018]})
df2

  Çalışanlar  İlk Giriş Yılları
0        Ali               2021
1       Ayşe               2019
2     Mehmet               2022
3      Fatma               2018